---
kind: method
id: M:Autodesk.Revit.DB.CustomFieldData.Dispose
source: html/24f965a9-7591-4629-e013-906495d884d6.htm
---
# Autodesk.Revit.DB.CustomFieldData.Dispose Method

Releases all resources used by the CustomFieldData

## Syntax (C#)
```csharp
public void Dispose()
```